IDEA StatiCa Open Model
Segment2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a segment in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Segment2D
 IdeaRS.OpenModel.Geometry2D.ArcSegment2D
 IdeaRS.OpenModel.Geometry2D.LineSegment2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class Segment2D : OpenObject
Public MustInherit Class Segment2D
	Inherits OpenObject
public ref class Segment2D abstract : public OpenObject
The Segment2D type exposes the following members.
Constructors
Name | Description
Segment2D
Initializes a new instance of the Segment2D class
Top
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace